# Словарь для хранения данных пользователей
user_data = {}

# Список вопросов и ответов
questions = [
    {
        "text": "Какая функция является производной от функции f(x) = x^3?",
        "options": ["3x^2", "3x", "x^2 + 3", "x^3 + 1"],
        "correct": 0
    },
    {
        "text": "Каков график функции y = x^2?",
        "options": ["Прямая линия", "Парабола", "Гипербола", "Круг"],
        "correct": 1
    },
    {
        "text": "Что изучает дифференциальное исчисление?",
        "options": ["Изменение функций", "Отношение сторон в треугольнике", "Теорию вероятностей", "Сложение чисел"],
        "correct": 0
    },
    {
        "text": "Что такое критические точки функции?",
        "options": [
            "Точки, в которых функция достигает своего максимального или минимального значения",
            "Точки, в которых производная функции равна нулю или не существует",
            "Точки, в которых функция пересекает ось x",
            "Точки, в которых график функции пересекает ось y"],
        "correct": 1
    },
    {
        "text": "На сколько вы оцениваете наш проект по шкале от 1 до 5?",
        "options": [
            "1 - Совсем не нравится",
            "2 - Не очень нравится",
            "3 - Нейтрально",
            "4 - Нравится",
            "5 - Очень нравится"
        ],
        "correct": 4  # Можете указать ожидаемый вами ответ или использовать этот вопрос без указания правильного ответа
    }

]